gsoap/cpp_files/PTZBinding.SetConfiguration.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
  xmlns:wsa5="http://www.w3.org/2005/08/addressing"
  xmlns:xmime="http://tempuri.org/xmime.xsd"
  xmlns:xop="http://www.w3.org/2004/08/xop/include"
  xmlns:tt="http://www.onvif.org/ver10/schema"
  xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
  xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
  xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
  xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
  xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <tptz:SetConfiguration>
    <tptz:PTZConfiguration token="">
     <tt:NodeToken></tt:NodeToken>
     <tt:DefaultAbsolutePantTiltPositionSpace></tt:DefaultAbsolutePantTiltPositionSpace>
     <tt:DefaultAbsoluteZoomPositionSpace></tt:DefaultAbsoluteZoomPositionSpace>
     <tt:DefaultRelativePanTiltTranslationSpace></tt:DefaultRelativePanTiltTranslationSpace>
     <tt:DefaultRelativeZoomTranslationSpace></tt:DefaultRelativeZoomTranslationSpace>
     <tt:DefaultContinuousPanTiltVelocitySpace></tt:DefaultContinuousPanTiltVelocitySpace>
     <tt:DefaultContinuousZoomVelocitySpace></tt:DefaultContinuousZoomVelocitySpace>
     <tt:DefaultPTZSpeed>
      <tt:PanTilt x="0.0" y="0.0" space="">
      </tt:PanTilt>
      <tt:Zoom x="0.0" space="">
      </tt:Zoom>
     </tt:DefaultPTZSpeed>
     <tt:DefaultPTZTimeout>0</tt:DefaultPTZTimeout>
     <tt:PanTiltLimits>
      <tt:Range>
       <tt:URI></tt:URI>
       <tt:XRange>
        <tt:Min>0.0</tt:Min>
        <tt:Max>0.0</tt:Max>
       </tt:XRange>
       <tt:YRange>
        <tt:Min>0.0</tt:Min>
        <tt:Max>0.0</tt:Max>
       </tt:YRange>
      </tt:Range>
     </tt:PanTiltLimits>
     <tt:ZoomLimits>
      <tt:Range>
       <tt:URI></tt:URI>
       <tt:XRange>
        <tt:Min>0.0</tt:Min>
        <tt:Max>0.0</tt:Max>
       </tt:XRange>
      </tt:Range>
     </tt:ZoomLimits>
     <tt:Extension>
      <tt:PTControlDirection>
       <tt:EFlip>
        <tt:Mode>OFF</tt:Mode>
       </tt:EFlip>
       <tt:Reverse>
        <tt:Mode>OFF</tt:Mode>
       </tt:Reverse>
       <tt:Extension>
       </tt:Extension>
      </tt:PTControlDirection>
      <tt:Extension>
      </tt:Extension>
     </tt:Extension>
     <tt:Name></tt:Name>
     <tt:UseCount>0</tt:UseCount>
    </tptz:PTZConfiguration>
    <tptz:ForcePersistence>false</tptz:ForcePersistence>
   </tptz:SetConfiguration>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
